# <div style="text-align:center;">Museum Of Moderne Art Data Exploration</div>

### Package import

In [104]:
import pandas as pd
import sqlite3 as sql

from datetime import datetime
import re

### Establish connection with the Database

In [11]:
path = "../data/"
db = path + "artists.db"
connector = sql.connect(db)

### First query

In [62]:
pd.read_sql("""SELECT COUNT(*) AS rowNb FROM artists;""", connector)

   rowNb
0  15091

#### <div style="text-align:center;">Now that we've established the connection, we are good to go !</div>

## SQL : Which artist in this data set lived the longest?

In [20]:
pd.read_sql("""SELECT Name, Nationality, Gender, `Birth Year`, `Death Year`, (`Death Year` - `Birth Year`) AS Age 
               FROM artists 
               WHERE Age = (
                 SELECT MAX(`Death Year` - `Birth Year`)
                 FROM artists
               );"""
            , connector)

,Name,Nationality,Gender,Birth Year,Death Year,Age
0,"Union Paper Bag Machine Company, Philadelphia, PA",None,None,1869,1999,130

Looks strange, an age equals to 130 years ? Hum the Name field contains 'Company', lets see if there is some other case like this ...

In [28]:
pd.read_sql("""SELECT Name, Nationality, Gender, `Birth Year`, `Death Year`, (`Death Year` - `Birth Year`) AS Age 
               FROM artists 
               WHERE LOWER(Name) LIKE '%company%'
               ORDER BY Age; """
            , connector).head() #pd.DataFrame.head() allows us to only print the 5 fists lines in the dataframe

,Name,Nationality,Gender,Birth Year,Death Year,Age
0,C.N. and Company,British,None,NaN,NaN,NaN
1,Robert Gair Company,American,None,NaN,NaN,NaN
2,"Karhula-Iitala, company design",Finnish,None,NaN,NaN,NaN
3,"Rosenthal Porzellan A.g., company design",German,None,1879.0,NaN,NaN
4,W.H.L. Skeen and Company,British,None,NaN,NaN,NaN

Okay, other companies exists and seems to have undefined lifetime ... Let's just take a look to the number of them and then we should be able to answer the question.

In [33]:
pd.read_sql("""SELECT count(*) AS CompaniesNb 
               FROM artists 
               WHERE LOWER(Name) LIKE '%company%'; """
            , connector)

   CompaniesNb
0           71

In [34]:
pd.read_sql("""SELECT count(*) AS CompaniesWithAgeNb
               FROM artists 
               WHERE LOWER(Name) LIKE '%company%'
               AND (`Death Year` - `Birth Year`) NOT NULL; """
            , connector)

   CompaniesWithAgeNb
0                   4

Recap : Compagnies are present in this dataset and most of them (94%) doest not have a defined lifetime.

In [36]:
pd.read_sql("""SELECT Name, Nationality, Gender, `Birth Year`, `Death Year`, (`Death Year` - `Birth Year`) AS Age 
               FROM artists 
               WHERE LOWER(Name) LIKE '%company%'
               AND Age NOT NULL
               ORDER BY Age; """
            , connector)

,Name,Nationality,Gender,Birth Year,Death Year,Age
0,"Vincent-HRD Company Ltd., Stevenage, Herts, En...",British,None,1928,1955,27
1,Rockwood and Company,American,None,1832,1911,79
2,Keystone View Company,American,None,1892,1972,80
3,"Union Paper Bag Machine Company, Philadelphia, PA",None,None,1869,1999,130

In addition, those wo have a defined age tend to bias the results (except for Vincent-HRD Company Ltd) and it is a tiny part of our dataset. <em>At this stage of exploration<em>, it seems to be adequate to aside them.

In [45]:
pd.read_sql("""SELECT Name, Nationality, Gender, `Birth Year`, `Death Year`, (`Death Year` - `Birth Year`) AS Age 
               FROM artists 
               WHERE Age = (
                 SELECT MAX(`Death Year` - `Birth Year`)
                 FROM artists
                 WHERE LOWER(Name) NOT LIKE '%company%'
               );"""
            , connector)

            Name Nationality  Gender  Birth Year  Death Year  Age
0  Leni Matthaei      German  Female        1873        1981  108
1      B. Efimov     Russian    Male        1900        2008  108

<div>According to Wikipedia,</div> 
<div><strong>Leni Matthaei</strong> : June 2, 1873 - January 24, 1981</div>
<div><strong>Boris Efimov</strong> : September 28, 1900 - October 1, 2008</div>

In [48]:
condition = ( datetime(1981, 1, 24) - datetime(1873, 6, 2) ) > ( datetime(2008, 10, 1) - datetime(1900, 9, 28) )
"Leni Matthaei lived the longest" if condition else "Boris Efimov lived the longest"

'Boris Efimov lived the longest'

#### <div style="text-align:center;">Boris Efimov is the one who lived the longest among MoMa artists</div>

## SQL : Who are the top 10 artists by the number of artworks?

In [98]:
pd.read_sql("""SELECT Name, COUNT(*) AS nbOfArtworks
               FROM artworks
               GROUP BY Name
               ORDER BY nbOfArtworks DESC 
               LIMIT 10;
            """
            , connector)

                       Name  nbOfArtworks
0              Eugène Atget          5050
1          Louise Bourgeois          3318
2  Ludwig Mies van der Rohe          2566
3      Unknown photographer          1575
4                      None          1460
5             Jean Dubuffet          1435
6           Lee Friedlander          1317
7             Pablo Picasso          1310
8              Marc Chagall          1162
9             Henri Matisse          1063

Here, we can see 2 feilds that aren't exact artist names : 'None' and 'Unkown photographer'. We should explore a bit to see where or not its relevant to ignore them as individual artists.

The easiest is to begin with 'None'. It is an obvious Null values in the <em>artworks</em>. Still, we should investigate before ignoring them.

In [103]:
pd.read_sql("""SELECT Name, Classification, COUNT(*) AS nbOfArtworks
               FROM artworks
               WHERE Name IS NULL
               GROUP BY Classification
               ORDER BY nbOfArtworks DESC;
            """
            , connector)

    Name              Classification  nbOfArtworks
0   None                       Print           336
1   None                        Film           226
2   None              (not assigned)           208
3   None                  Periodical           189
4   None                  Photograph           132
5   None               Work on Paper           119
6   None  Frank Lloyd Wright Archive            53
7   None                       Media            43
8   None                      Design            38
9   None            Illustrated Book            37
10  None                    Multiple            26
11  None                     Drawing            22
12  None                Installation            14
13  None                       Video            12
14  None                Architecture             3
15  None                       Audio             1
16  None                    Painting             1

We can see here quite a range of Classification, it is obvious that one artist cannot master all these technique in one life time. We should not consider None value as one artist.

In [115]:
pattern = re.compile('(\d{4})')
years = pd.read_sql("""SELECT Date 
                       FROM artworks
                       WHERE Name LIKE 'Unknown photographer';
                       """
                    , connector)
years.replace(to_replace='(\d{4})', value=, regex=True, inplace=True)
years.head(25)

error: bad escape \d at position 1